# 词性标注的构建
# nm  课程名
# ut 学院名
# rr 老师名字
# sst 课程类型名

# Question - 0 : 课程评价
q0 = [
    "nm这门课给分怎么样",
    "nm这门课给分"
    "nm给分怎么样",
    "nm给分",
    "nm给分好不好",
    "nm的评价",
    "nm评价",
]


# Question - 1 : 某位老师开设哪些课程

q1 = [
    "rr教哪些课程",
    "rr上的课",
    "rr上的课程有哪些",
    "rr教什么课",
    "rr上的课程",
    "rr上什么课",
    "rr教什么课",
    "rr上的课程",
]


# Question - 2 : 某门课的类型

q2 = [
    "nm的类型",
    "nm是什么类型的课"
    "nm的类型",
   
]

# Question - 3 : 某位老师开设的某种类型的课程有哪些

q3 = [
    "rr上的sst类型的",
    "rr上的sst",
    "rr上的sst有哪些",
    "rr教哪些sst课程",
    "rr教哪些sst",
    "rr上的sst课程",
    "rr上的sst课程"
]


# Question - 4 : 某个学院开设了什么课

q4 = [
    "ut开设的课",
    "ut开的课有哪些",
    "ut开设什么课",
    "ut的课",
    "ut开设的课",
    "ut开设的课",
    "ut开设的课",
]

# Queston - 5 : 某个学院开设的某种类型的课

q5 = [
    "ut开设的sst",
    "ut开设的sst类型的课程有",
    "ut开设的sst类型的课程",
    "ut开设的sst",
    "ut开设的sst课",
]


# Question - 6 : 教师A与教师B共同教授的课

q6 = [
    "rr与rr",
    "rr与rr",
    "rr与rr",
    "rr与rr一起上的课",
    "rr与rr一起上的课",
    "rr与rr一起上的课有哪些",
    "rr与rr一起教授的课",
]

# Question - 7 : 教师上多少门课

q7 = [
    "rr教几门课程",
    "rr教几门",
    "rr上几门",
    "rr教多少门",
    "rr教多少门",
] 


# Question - 8 : 某个院系开设的某类给分不错的课程
q8 = [
    "ut开设给分不错的nnt课程",
    "ut开的给分好的nnt课程",
    "ut开设的评价好的nnt课程",
    "ut开的评价不错的nnt课程",
    "ut开设的nnt中评价不错的课",
    "ut开设的nnt中评价好的课",
    "ut开设的nnt中给分好的课"
]

# Question - 9 :某个类型的给分不错的课
q9 = [
    "sst给分好的课",
    "sst中给分不错的课",
    "sst中评价不错的课",
    "sst中评价好的课",
    "sst里给分不错的课",
    "sst里给分好的课",
]